app/models/comment.rb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 3], ["updated_at", "2022-09-30 06:07:12.460657"], ["id", 5]]
---
  def update_comments_counter
    post.update(comments_counter: post.comments.count)